In [1]:
import pandas as pd
import numpy as np

In [2]:
np.random.seed(12345)

In [3]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), 
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), 
                   columns=list('abcde'))
print(df1)
print(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [4]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [5]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [6]:
obj = pd.Series(np.arange(4), index=list('dabc'))
print(obj)
print('\n', obj.sort_index())

frame = pd.DataFrame(np.arange(8).reshape(2,4),
                     index=['three', 'one'],
                     columns=list('dabc'))
frame

d    0
a    1
b    2
c    3
dtype: int32

 a    1
b    2
c    3
d    0
dtype: int32

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [8]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [9]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [10]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [14]:
obj1 = pd.Series([4,7,-3,2])
print(obj1)
print(obj1.sort_values())

0    4
1    7
2   -3
3    2
dtype: int64
2   -3
3    2
0    4
1    7
dtype: int64

In [15]:
frame2 = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame2

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [16]:
frame2.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [17]:
frame2.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [3]:
frame = pd.DataFrame(np.random.randn(4,2),
                    index=list('abcd'),
                    columns=['one','two'])
frame

        one       two
a -0.204708  0.478943
b -0.519439 -0.555730
c  1.965781  1.393406
d  0.092908  0.281746

In [4]:
frame.sum(axis=0)

one    1.334542
two    1.598365
dtype: float64

In [5]:
frame.mean(axis=1)

a    0.137118
b   -0.537585
c    1.679593
d    0.187327
dtype: float64

In [6]:
frame.describe()

            one       two
count  4.000000  4.000000
mean   0.333636  0.399591
std    1.116452  0.800102
min   -0.519439 -0.555730
25%   -0.283390  0.072377
50%   -0.055900  0.380345
75%    0.561126  0.707559
max    1.965781  1.393406

In [18]:
obj1 = pd.Series([1, np.nan, 3.5, np.nan, 7])
print(obj1)
print(obj1.dropna())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64
0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
frame = pd.DataFrame(np.random.randn(7,3))
frame.iloc[:4, 1] = np.nan
frame.iloc[:2, 2] = np.nan
frame

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [20]:
frame.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741